
//LIVE
//const SERVICE_HOST_NAME ='https://sbilposservices.sbilife.co.in/';

//UAT
const SERVICE_HOST_NAME ='https://sbiluatposservices.sbilife.co.in/';

const serviceURL = SERVICE_HOST_NAME + 'Service.asmx?wsdl';
const serviceURLOne = SERVICE_HOST_NAME + 'Service.asmx';

const strAuth = "QzhCNDc0OTU4NzZDQjI3RTQ4OEMyNEQ3MUZCQjE2QTY=";
const commonEmail = 'a@g.com';
const commonMobile = '0000000000';

function showLoader(loader) {
    document.getElementById(loader).style.display = "block";
}

function hideLoader(loader) {
    document.getElementById(loader).style.display = "none";
}

function unescapeHTML(escapeHTML) {
    return escapeHTML.replace(/&lt;/g, '<').replace(/&gt;/g, '>');
};

function escapeInputHTML(unEscapeHTML) {
    return unEscapeHTML.replace(/&/g, "&amp;").replace(/>/g, "&gt;").replace(/</g, "&lt;").replace(/"/g, "&quot;");
};

function parseToJson(xml) {
    dom = parseXml(xml);
    json = xml2json(dom);
    return json;
}

function parseXml(xml) {

    var dom = null;
    if (window.DOMParser) {
        try {
            dom = (new DOMParser()).parseFromString(xml, "text/xml");
        } catch (e) { dom = null; }
    } else if (window.ActiveXObject) {
        try {
            dom = new ActiveXObject('Microsoft.XMLDOM');
            dom.async = false;
            if (!dom.loadXML(xml)) // parse error ..

                window.alert(dom.parseError.reason + dom.parseError.srcText);
        } catch (e) { dom = null; }
    } else
        alert("cannot parse xml string!");
    return dom;
}

function xml2json(xml) {
    try {
        var obj = {};
        if (xml.children.length > 0) {
            for (var i = 0; i < xml.children.length; i++) {
                var item = xml.children.item(i);
                var nodeName = item.nodeName;

                if (typeof (obj[nodeName]) == "undefined") {
                    obj[nodeName] = xml2json(item);
                } else {
                    if (typeof (obj[nodeName].push) == "undefined") {
                        var old = obj[nodeName];

                        obj[nodeName] = [];
                        obj[nodeName].push(old);
                    }
                    obj[nodeName].push(xml2json(item));
                }
            }
        } else {
            obj = xml.textContent;
        }
        return obj;
    } catch (e) {
    }
};

function dateDDFullMonthYYYY(date) {
    var arrDate = date.split("-");
    const monthNames = ["January", "February", "March", "April", "May", "June",
        "July", "August", "September", "October", "November", "December"
    ];
    if (arrDate != null) {
        var index;
        if (arrDate[1] != null) {
            index = Number(arrDate[1]) - 1;
            return arrDate[2] + "-" + monthNames[index] + "-" + arrDate[0];
        } else {
            return arrDate[0] + "-" + arrDate[1] + "-" + arrDate[2];
        }
    }
}

function compressionEvent(filee) {
    return new Promise((resolv, reject) => {
        console.log(`File Recieved : ${filee.size} bytes`);
        var imageCompressed = new ImageCompressor();
        var compressionOption = { quality: .4, checkOrientation: true };
        imageCompressed.compress(filee, compressionOption).then(resolved => {
            console.log(`Compressed Image Size ${resolved.size} bytes`);
            // document.getElementById('imgae').src = URL.createObjectURL(resolved);
            getBase64(resolved).then(resolve => {
                resolv(resolve);
            }, (rejected) => {
                console.log(rejected);
            }).catch(err => console.log(err));
        }, (rejected) => {
            console.log({ rejected });
        }).catch(err => {
            console.log(err)
        });
    })
}

function getBase64(file) {
    return new Promise((resolve, reject) => {
        var reader = new FileReader();
        reader.readAsDataURL(file);
        reader.onload = function () {
            let encoded = reader.result.replace(/^data:(.*;base64,)?/, '');
            if ((encoded.length % 4) > 0) {
                encoded += '='.repeat(4 - (encoded.length % 4));
            }
            resolve(encoded);
            //resolve(reader.result);
        };
        reader.onerror = function (error) {
            reject(error);
        };
    });
}

function getQueryStringDesializedData(key) {
    var queryString = decodeURIComponent(window.location.search);
    queryString = queryString.substring(1);
    var queries = queryString.split("&");
    return JSON.parse(queries[0].split(key).pop());
}

function getFileExtension(filePath) {
    return new Promise((resolve, reject) => {

        var exten = filePath.substr(filePath.lastIndexOf('\\') + 1).split('.')[1];

        if (exten == "exe" || exten == "apk") {
            reject("This file Format cannot be uploaded");
        } else {
            resolve(exten);
        }

    });
}

function getByteCode(fileBase64) {

    file = fileBase64.replace(('data:application/pdf;base64,'), "");
    return file;
}

function returnFormVariableValue(variable) {
    return document.getElementById(variable).value;
}

function getSelectedLangauge(custName, mobile, proposalNo){

    let arrLanguage = [
        {
            lang: 'English',
            title: 'Statement by the Customer',
            label: `(Engish - Kindly write following consent on paper in your preferred language, sign it and upoad the same.)`,
            desc : `Myself ${custName}.<br>My mobile no is ${mobile}.<br>I confirm the details given in the proposal.`
        },
        {
            lang: 'Hindi',
            title: 'उपभोक्ता द्वारा घोषणा',
            label: `(कृपया अपनी पसंदीदा भाषा में कागज पर निम्नलिखित सहमति लिखें, हस्ताक्षर करें और अपलोड करें।)`,
            desc : `मैं ${CUST_NAME}.<br>मेरा मोबाइल नंबर ${CUST_MOBILE_NUMBER} है.<br>मैं प्रस्ताव पत्र में दी गई जानकारीयों की पुष्टि करता/करती हूँ|`
        },
        {
            lang: 'Kannada',
            title: 'ಗ್ರಾಹಕರಿಂದ ಘೋಷಣೆ',
            label: `(ಕನ್ನಡ - ನಿಮ್ಮ ಆದ್ಯತೆಯ ಭಾಷೆಯಲ್ಲಿ ಕಾಗದದ ಮೇಲೆ ಈ ಕೆಳಗಿನ ಒಪ್ಪಿಗೆಯನ್ನು ದಯವಿಟ್ಟು ಬರೆಯಿರಿ, ಸಹಿ ಮಾಡಿ ಮತ್ತು ಅದನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡಿ.)`,
            desc : `ನಾನು ${custName}.<br>ನನ್ನ ಮೊಬೈಲ್ ನಂಬರ್ ${mobile}.<br>ಒಟಿಪಿ ಮೂಲಕ ನನ್ನ ಮೊಬೈಲ್ ಸಂಖ್ಯೆಗೆ ಬಂದಿರುವ ಪ್ರಸ್ತಾಪದ  ಮಾಹಿತಿಯನ್ನು ದೃಡೀಕರಿಸುತ್ತೇನೆ.`
        },
        {
            lang: 'Punjabi',
            title: 'ਗਾਹਕ ਤੋਂ ਐਲਾਨ',
            label: `(ਕਿਰਪਾ ਕਰਕੇ ਆਪਣੀ ਪਸੰਦ ਦੀ ਭਾਸ਼ਾ ਵਿੱਚ ਕਾਗਜ਼ ਉੱਤੇ ਹੇਠ ਲਿਖਤੀ ਸਹਿਮਤੀ ਲਿਖੋ, ਦਸਤਖਤ ਕਰੋ ਅਤੇ ਅਪਲੋਡ ਕਰੋ.)`,
            desc : `ਮੈਂ ${custName}.<br>ਮੇਰਾ ਮੋਬਾਇਲ ਨੰਬਰ ${mobile}.<br>ਮੈਂ ਆਪਣੇ ਮੋਬਾਇਲ ਤੇ ਪ੍ਰਾਪਤ ਓਟੀਪੀ ਰਾਹੀਂ ਪ੍ਰਸਤਾਵ ਵਿਚ ਦਿੱਤੇ ਵੇਰਵਿਆਂ ਦੀ ਪੁਸ਼ਟੀ ਕੀਤੀ ਹੈ।`
        },
        {
            lang: 'Odia',
            title: 'ଗ୍ରାହକ ଘୋଷଣା',
            label: `(ଦୟାକରି ଆପଣଙ୍କର ପସନ୍ଦିତ ଭାଷାରେ କାଗଜରେ ନିମ୍ନଲିଖିତ ସମ୍ମତି ଲେଖନ୍ତୁ, ଦସ୍ତଖତ କରନ୍ତୁ ଏବଂ ଅପଲୋଡ୍ କରନ୍ତୁ |)`,
            desc : `ମୁଁ ${custName}.<br>ମୋ ମୋବାଇଲ୍ ନମ୍ବର ${mobile}.<br>ମୁଁ  ପ୍ରସ୍ତାବ ରେ ଦିଆଯାଇଥିବା ସୂଚନ ଏବଂ ଘୋଷଣାକୁ ମୋ ମୋବାଇଲ୍ ରେ ପ୍ରାପ୍ତ OTP ମାଧ୍ୟମରେ ନିଶ୍ଚିତ କରେ |`
        },
        {
            lang: 'Telugu',
            title: 'వినియోగదారుల ప్రకటన',
            label: `(దయచేసి మీ ఇష్టపడే భాషలో కాగితంపై ఈ క్రింది సమ్మతిని వ్రాసి, సంతకం చేసి, అప్‌లోడ్ చేయండి.)`,
            desc : `నేను ${custName}.<br>నా మొబైల్ నంబర్ ${mobile}.<br>నా మొబైల్లో అందుకున్న OTP ద్వారా ప్రతిపాదనలో ఇచ్చిన వివరాలను నేను ధృవీకరిస్తున్నాను.`
        },
        {
            lang: 'Tamil',
            title: 'நுகர்வோர் அறிவிப்பு',
            label: `(தயவுசெய்து பின்வரும் விருப்பத்தை நீங்கள் விரும்பும் மொழியில் காகிதத்தில் எழுதவும், கையொப்பமிடவும் பதிவேற்றவும்.)`,
            desc : `நான் ${custName}.<br>எனது கைபேசி எண் ${mobile}.<br>முன்மொழிவு படிவத்தில் கொடுக்கப்பட்ட தகவல்களை எனது கைபேசி எண்ணில் பெறப்பட்ட OT P மூலம் உறுதி செய்கிறேன்.`
        },
        {
            lang: 'Bengali',
            title: 'গ্রাহক ঘোষণা',
            label: `(দয়া করে আপনার পছন্দের ভাষায় কাগজে নিম্নলিখিত সম্মতি লিখুন, স্বাক্ষর করুন এবং আপলোড করুন))`,
            desc : `আমি, ${custName}.<br>আমার মোবাইল নঃ ${mobile}.<br>আমি, proposal প্রদত্ত তথ্য আমার মোবাইল এ পাওয়া OTP এর মাধ্যমে নিশ্চিত করলাম।`
        },
        {
            lang: 'Marathi',
            title: 'ग्राहक घोषणा',
            label: `(कृपया आपल्या पसंतीच्या भाषेत कागदावर खालील संमती लिहा, सही करा आणि अपलोड करा.)`,
            desc : `मी ${custName}.<br>माझा मोबाईल क्रमांक आहे ${mobile}.<br>मी सदर प्रस्ताव क्रमांक मध्ये प्रदान केलेली माहिती माझ्या मोबाईल क्रमांकावर प्राप्त झालेल्या ओटीपीव्दारे प्रमाणित करत आहे.`
        },
        {
            lang: 'Malyalam',
            title: 'ഉപഭോക്തൃ പ്രഖ്യാപനം',
            label: `(ദയവായി നിങ്ങൾ ഇഷ്ടപ്പെടുന്ന ഭാഷയിൽ പേപ്പറിൽ ഇനിപ്പറയുന്ന സമ്മതം എഴുതുക, ഒപ്പിടുക, അപ്‌ലോഡ് ചെയ്യുക.)`,
            desc : `ഞാൻ ${custName}.<br>എന്റെ റ ാബൈൽ നമ്പർ ${mobile}.<br>എന്റെ റ ാബൈലിൽ ലഭിച്ച OTPലൂറെ റ്രാപ്പാസലിറല വിവരങ്ങൾ ഞാൻ സ്ഥിരീകരിക്കുന്നു`
        }/* ,
        {
            lang: 'Assemes',
            title: 'কাস্টমার ডিক্লারেশন',
            label: `(প্লিজ উড়িতে, সিগণ এন্ড আপলোড টি ফল্লওইং কনসেন্ট ও পেপার ইন ইওর প্রেফার্ড ল্যাঙ্গুয়েজে.)`,
            desc : `মই ${custName} এই ${proposalNo} দি■সকলো ত■আৰু প্ৰতিবেদন মোৰ মোবাইল নম্বৰত ${proposalNo} পোৱা OTP ৰ মাধ্যমেৰে বৈধকৰণ কৰিলো। চহী`
        } */
    
    ]
    
    return arrLanguage;
}

function getAadhaarConsentLanguage(localLang, custName, mobile, productName){

    let UINNo = "";
    insuranceCalcPlanPageListData.forEach(element => {
        if(element.title.includes(productName)){
            UINNo = element.uinNumber;
        }
    });

    let arrLanguage = [
        {
            lang: 'Assamese',
            desc1 : `মই, শ্রী <font color='blue'>${custName}</font>, ইয়াৰ দ্বাৰা এচবিআই লাইফ ইঞ্চিওৰেন্স কোম্পানী লিমিটেড (এচবিআই লাইফ)ক স্বেচ্ছাই মোৰ সন্মতি প্রদান কৰিছোঁ আৰু কোম্পানীক আৱশ্যকীয় বিৱৰণ যেনে নাম, জন্ম তাৰিখ, ঠিকনা, মোবাইল নম্বৰ, ইমেইল, ফটোগ্রাফ মোৰ আধাৰ কার্ডত উপলব্ধ আধাৰ কার্ডৰ প্রতিলিপি/কিউআৰ ক’ড/ ইউআইডিএআই-ৰ অফলাইন সত্যৰ নিৰূপণ প্রক্রিয়া প্রয়োগ কৰি আদান-প্রদান কৰা এক্সএমএল ফাইলৰ জৰিয়তে লাভ কৰাৰ হেতুকে প্রাধিকৃত কৰোঁ৷ মই বুজি পাওঁ আৰু সন্মতি প্রদান কৰোঁ যে এই জাননী কেৱল কেৱাইচি-ৰ প্রয়োজনৰ বাবে আৰু মোৰ সৈতে সম্বন্ধীয় সেৱা/সমূহৰ বাবে বিশেষভাৱে প্রয়োগত লোৱা হ’ব, য’ত কেৱাইচি আৱশ্যকতাসমূহ মানি চলিব লাগিব, লাইফ ইঞ্চিওৰেন্সৰ বাবে মোৰ প্রস্তাৱৰ অন্তর্গত ক্ষতিশংকাৰ স্বীকার্যতাৰ পিছত পলিচি ইচ্ছ্যু কৰাৰ পৰা, বিভিন্ন আদায়সমূহ যি পলিচিসমূহৰ অন্তর্গত কৰা হয়, বিভিন্ন জৰুৰীকালীন স্থিতি য’ত কেৱাইচি জাননী বাধ্যতামূলক, কন্ট্রেক্ট সমাপ্ত হোৱালৈকে৷ মোক অৱগত কৰা হৈছে যে মই বৈকল্পিক নথিপত্র যেনে পাছপোর্ট, ভোটদাতা পৰিচয় পত্র, ড্রাইভিং লাইচেঞ্চ, এনৰেগা জব কার্ড, নেচনেল পপুলেশ্যন ৰেজিষ্টাৰৰ পত্রৰ প্রয়োগ মোৰ কেৱাইচি-ৰ আনুষ্ঠানিকতাসমূহ সম্পূর্ণ কৰাৰ প্রয়োজনৰ বাবে আধাৰৰ সলনি প্রয়োগ কৰিব পৰা যায়৷ মই বুজি পাওঁ আৰু সন্মতি প্রদান কৰোঁ যে এই ধৰণে লাভ কৰা বিৱৰণসমূহ এচবিআই লাইফৰ ওচৰত সংগ্রীহিত কৰা হ’ব আৰু মোক ইঞ্চিওৰেন্স পলিচি জাৰী কৰাৰ প্রয়োজন আৰু সেৱাৰ বাবেহে কেৱল আদান-প্রদান কৰা হৈছে৷ মোৰ দ্বাৰা প্রদান কৰা যি কোনো ভুল জাননীৰ ক্ষেত্রত মই এচবিআই লাইফ বা ইয়াৰ যি কোনো প্রাধিকৃত বিষয়াক দায়ী সাব্যস্ত নকৰোঁ৷ মই এচবিআই লাইফক এইটো অধিকাৰো দিওঁ যাতে ই বিভিন্ন সেৱা সম্বন্ধীয় আৰু মোৰ পলিচিৰ সৈতে সম্বন্ধীয় অন্য বিষয়ৰ ক্ষেত্রত এচএমএচ এলার্ট পঠিওৱাৰ বাবে মোৰ মোবাইল নম্বৰ প্রয়োগ কৰিব পাৰে।`,
            desc2 : `মই, শ্রী <font color='blue'>${custName}</font>, ইয়াৰ দ্বাৰা প্রমাণিত প্রক্রিয়াৰ বাবে ওৱান টাইম পাছৱর্ড (অ’টিপি’) পঠিওৱাৰ বাবে আপোনাৰ মোবাইল নম্বৰ প্রয়োগ কৰাৰ বাবে এচবিআই লাইফ ইঞ্চিওৰেন্স কোম্পোনী লিমিটেডক মোৰ সন্মতি প্রদান কৰিছোঁ আৰু মই ইয়াৰ দ্বাৰা সন্মতি প্রদান কৰিছো যে অ’টিপি সত্যাপনৰ জৰিয়তে প্রমাণ প্রস্তাৱ ফর্মত মোৰ চহী হিচাপে মানি লোৱা হ’ব আৰু এইটো যে এবাৰ অ’টিপি আধাৰিত প্রমাণ হৈ যোৱাৰ পিছত এম নথিপত্রত মোৰ কাগজৰ স্বাক্ষৰৰ প্রয়োজন নাই৷ এচবিআই লাইফ লাইফ ইঞ্চিওৰেন্স কোম্পানী লিমিটেডে মোক অৱগত কৰিছে যে এই অ’টিপি-ৰ প্রয়োগ কেৱল <font color='blue'>${productName} - ${UINNo}</font> ৰ বাবে মোৰ এচবিআই লাইফ আৱেদন ফর্মৰ প্রক্রিয়া কৰাৰ বাবে কৰা হ’ব৷`
        },
        {
            lang: 'Bengali',
            desc1 : `আমি, শ্রী <font color='blue'>${custName}</font>, এতদ্বারা UIDAI-এর অফলাইন যাচাইকরণ প্রক্রিয়া ব্যবহার করে আমার আধার কার্ড/XMLফাইল শেয়ার করে পাওয়া যাওয়া আধার কার্ডের কপি/QR কোড- মাধ্যমে নাম, জন্ম তারিখ, ঠিকানা, মোবাইল নাম্বার, ই-মেইল, ফোটোগ্রাফের মতো আবশ্যক বিবরণ প্রাপ্ত করতে এসবিআই লাইফ ইন্স্যুরেন্স কোম্পানী লিমিটেড (এসবিআই লাইফ)’কে আমার স্বেচ্ছামূলক সম্মতি দিচ্ছি এবং কোম্পানীকে অনুমোদন করছি| আমি বুঝি এবং একমত যে এই তথ্য স্বতন্ত্রভাবে এসবিআই লাইফ দ্বারা কেবলমাত্র KYC উদ্দেশ্যের জন্যে এবং আমার পলিসি/সমূহের সঙ্গে সম্বন্ধিত সকল পরিষেবাগুলির  জন্যে, লাইফ ইন্স্যুরেন্সের জন্যে আমার প্রস্তাবনার অধীনে ঝুঁকি মেনে নেওয়ার পর, পলিসিসমূহ জারি করা থেকে শুরু করে চুক্তি শেষ না হওয়া পর্যন্ত, বিভিন্ন পেমেন্ট, যা পলিসিসমূহের অধীনে হয়ত করতেই হবে, বিভিন্ন আকস্মিক ঘটনা যেখানে KYC তথ্য বাধ্যতামূলক এমন যেখানেই KYC প্রয়োজনীয়তা সম্মত করতে হবে সেখানে ব্যবহৃত হবে| আমি যথাযথভাবে অবগত আছি যে আমার KYC রীতিনীতি সম্পূর্ণ করার উদ্দেশ্যের জন্যে আধার কার্ডের পরিবর্তে পাসপোর্ট, ভোটার আইডি কার্ড, ড্রাইভিং লাইসেন্স, NREGA জব কার্ড, ন্যাশনাল পপুলেশন রেজিষ্টার থেকে পত্রের মতো বিকল্প KYC তথ্যসমূহও আমি ব্যবহার করতে পারি| আমি বুঝি এবং একমত যে প্রাপ্ত হওয়া বিবরণ এসবিআই লাইফ-এর কাছে মজুত থাকবে এবং আমাকে পলিসি জারি করার উদ্দেশ্যের জন্যে আর এর পরিষেবা বজায় রাখার জন্যে একান্তভাবে ভাগীদারি করা হবে| আমার দ্বারা প্রদত্ত যেকোন বেঠিক তথ্যের ক্ষেত্রে আমি এসবিআই লাইফ বা ইহার কোনও অফিসিয়াল’কে দায়ী করবো না| অধিকন্তু আমি এসবিআই লাইফ’কে অনুমোদন করছি যে, আমার পলিসি/সমূহের সঙ্গে সম্বন্ধিত বিভিন্ন পরিষেবা এবং অন্যান্য বিষয়ের ব্যাপারে আমাকে সতর্ক করতে পাঠানো SMS-এর জন্যে আমার মোবাইল নাম্বার ব্যবহার করতে পারে|`,
            desc2 : `আমি, শ্রী <font color='blue'>${custName}</font>, এতদ্বারা প্রামাণিকতা উদ্দেশ্যাবলীর জন্যে ওয়ান টাইম পাসওয়ার্ড (OTP) পাঠানোর জন্যে আমার মোবাইল নাম্বার ব্যবহার করতে এসবিআই লাইফ ইন্স্যুরেন্স কোম্পানী লিঃ’কে আমার সম্মতি দিচ্ছি এবং আমি এতদ্বারা একমত হচ্ছি আর সম্মতি দিচ্ছি যে, প্রোপোজাল ফর্মের ওপর আমার স্বাক্ষর হিসাবে  OTP যাচাইকরণ মাধ্যমে প্রামাণিকতা বিবেচিত হবে এবং সেক্ষেত্রে একবার  OTP ভিত্তিক প্রামাণিকতা হয়ে গেলে, এইসব দস্তাবেজের ওপর আমার বাস্তবিক স্বাক্ষরের কোনও দরকার নেই| এসবিআই লাইফ ইন্স্যুরেন্স কোম্পানী লিঃ আমাকে জ্ঞাত করেছে যে, এই OTP কেবলমাত্র <font color='blue'>${productName} - ${UINNo}</font> -এর জন্যে আমার এসবিআই লাইফ অ্যাপ্লিকেশন ফর্ম প্রক্রিয়াকরণের হেতু ব্যবহৃত হবে|`
        },
        {
            lang: 'Gujarati',
            desc1 : `હું,મિ. <font color='blue'>${custName}</font> આ દ્વારા એસબીઆઈ લાઈફ ઈન્શ્યૉરન્સ કંપની લિમિટેડ (એસબીઆઈ લાઈફ)ને સ્વેચ્છાએ મારી સંમતિ આપું છું અને કંપનીને આવશ્યક વિગતો જેવી કે નામ, જન્મ તારીખ, સરનામું, મોબાઈલ નંબર, ઈમેઈલ, ફોટોગ્રાફ યુઆઈડીએઆઈની ઑફલાઈન વેરિફિકેશન પ્રક્રિયાના ઉપયોગ દ્વારા શૅર કરેલ મારા આધાર કાર્ડ/એક્સએમએલ ફાઈલ પર ઉપલબ્ધ આધાર કાર્ડની નકલ/ક્યૂઆર કોડ મારફત મેળવવા અધિકૃત કરું છું. હું સમજું અને સહમત થાઉં છું કે આ માહિતી એસબીઆઈ લાઈફ દ્વારા માત્ર કેવાયસી અને મારી પૉલિસી/ઓ સંબંધિત દરેક સેવાના હેતુઓ, જ્યાં પણ કેવાયસી આવશ્યકતાઓનું પાલન કરવાનું હોય, જીવન વીમા માટેના મારા પ્રસ્તાવ હેઠળ જોખમ સ્વીકાર્યા પછી પૉલિસીઓ જારી કરવાથી લઈને પૉલિસીઓ હેઠળ કરવાની રહેતી વિવિધ ચૂકવણીઓ, વિવિધ આકસ્મિકતાઓ કે જ્યાં કેવાયસી માહિતી ફરજિયાત હોય અને કૉન્ટ્રાક્ટ રદ ન કરવામાં આવે ત્યાં સુધી જ ઉપયોગ કરાશે. મને સારી રીતે જણાવવામાં આવ્યું છે કે હું વૈકલ્પિક કેવાયસી દસ્તાવેજો જેમ કે પાસપોર્ટ, મતદાતા ઓળખપત્ર, ડ્રાઈવિંગ લાઈસન્સ, નરેગા જોબ કાર્ડ, નૅશનલ પોપ્યુલેશન રજિસ્ટર તરફથી મળેલ પત્રનો પણ મારી કેવાયસી ઔપચારિકતા પૂરી કરવાના હેતુસર આધારની બદલે ઉપયોગ કરી શકું છું. હું સમજું અને સહમત થાઉં છું કે આ રીતે મેળવેલી વિગતો એસબીઆઈ લાઈફમાં સંગ્રહ કરાશે અને મને વીમા પૉલિસી જારી કરવા અને તેની સેવાના એકમાત્ર હેતુસર વહેંચવામાં આવશે. હું એસબીઆઈ લાઈફ અથવા તેના કોઈ અધિકૃત અધિકારીઓને મારા તરફથી કોઈ ખોટી માહિતી પૂરી પાડવાના કિસ્સામાં જવાબદાર નહીં ઠેરવું. હું એસબીઆઈ લાઈફને વધુમાં અધિકૃતતા આપું છું કે તે મારી પૉલિસી/ઓ સંબંધિત વિવિધ સેવાઓ અને અન્ય બાબતો વિશે એસએમએસ એલર્ટસ મોકલવા મારા મોબાઈલ નંબરનો ઉપયોગ કરી શકે છે.`,
            desc2 : `હું, મિ. <font color='blue'>${custName}</font> એસબીઆઈ લાઈફ ઈન્શ્યૉરન્સ કંપની લિમિટેડને પ્રમાણભૂતતાના હેતુઓસર વન ટાઈમ પાસવર્ડ (ઓટીપી) મોકલવા મારા મોબાઈલ નંબરનો ઉપયોગ અધિકૃત કરું છું અને હું આ દ્વારા સહમત થાઉં અને સંમતિ આપું છું કે ઓટીપી વેરિફિકેશન મારફત કરેલ પ્રમાણભૂતતા પ્રપોઝલ ફોર્મ પર મારી સહી તરીકે માનવામાં આવશે અને એકવાર ઓટીપી આધારિત પ્રમાણભૂતતા પૂર્ણ થયા પછી આ દસ્તાવેજો પર મારી ફિઝિકલ સહીઓની કોઈ જરૂર નથી રહેતી. એસબીઆઈ લાઈફ ઈન્શ્યૉરન્સ કંપની લિમિટેડે મને જણાવ્યું છે કે આ ઓટીપીનો ઉપયોગ માત્ર <font color='blue'>${productName} - ${UINNo}</font> માટે મારા એસબીઆઈ લાઈફ અરજી પત્રકની પ્રક્રિયા માટે જ કરવામાં આવશે.`
        },
        {
            lang: 'Hindi',
            desc1 : `मैं, श्री <font color='blue'>${custName}</font>, एतद्द्वारा एसबीआई लाइफ इंश्योरेंस कंपनी लिमिटेड (एसबीआई लाइफ) को स्वेच्छा से अपनी सहमति देता/देती हूं और कंपनी को आवश्यक विवरण जैसे नाम, जन्मतिथि, पता, मोबाइल नंबर, ईमेल,  मेरे  आधार कार्ड की प्रति पर फोटोग्राफ / आधार कार्ड पर उपलब्ध क्यूआर कोड/यूआईडीएआई की ऑफलाइन सत्यापन प्रक्रिया का उपयोग करके साझा की गई एक्सएमएल फाइल के ज़रिए हासिल करने हेतु अधिकृत करता/करती हूं। मैं समझता/ समझती और सहमत हूँ कि यह जानकारी केवल केवाईसी प्रयोजन के लिए और मेरी पॉलिसी/सियों से संबंधित सभी सेवा पहलुओं के लिए विशेष रूप से उपयोग में लाई जाएगी, जहाँ कहीं केवाईसी आवश्यकताओं का पालन करना है, वहाँ जीवन बीमा के लिए मेरे प्रस्तावों के अंतर्गत जोखिम की स्वीकार्यता के बाद पॉलिसी जारी करने से लेकर, विभिन्न भुगतानों जो पॉलिसियों के अंतर्गत किए जाने हैं, विभिन्न आपात् स्थितियाँ जहाँ केवाईसी जानकारी अनिवार्य है, अनुबंध के निरस्त होने तक। मुझे बताया गया  है कि मैं वैकल्पिक दस्तावेजों जैसे पासपोर्ट, मतदाता पहचान पत्र, ड्राइविंग लाइसेंस, नरेगा जॉब कार्ड, नेशनल पॉपुलेशन रजिस्टर के पत्र का उपयोग अपनी केवाईसी की औपचारिकताओं को पूर्ण करने के प्रयोजन के लिए आधार के बदले उपयोग भी कर सकता/सकती हूं। मैं समझता/समझती और सहमत हूँ कि इस तरह  से प्राप्त विवरणों को एसबीआई लाइफ के पास संग्रहित किया जाएगा और मुझे बीमा पॉलिसी जारी करने के प्रयोजन और उनकी सेवा करने के लिए ही केवल साझा किया जाएगा। मेरे द्वारा प्रदान की गई किसी भी गलत जानकारी के मामले में, मैं एसबीआई लाइफ या उनके किसी भी अधिकृत अधिकारियों को जिम्मेदार नहीं ठहराऊंगा/ठहराऊंगी। मैं एसबीआई लाइफ को यह अधिकार भी देता/देती हूँ कि वह विभिन्न सेवा संबंधी और मेरी पॉलिसी से संबंधित अन्य मामलों के बारे में एसएमएस एलर्ट्स भेजने के लिए मेरे मोबाइल नंबर का उपयोग कर सकते है।`,
            desc2 : `मैं, श्री <font color='blue'>${custName}</font> एतद्द्वारा प्रमाणन प्रक्रियाओं के लिए वन टाइम पासवर्ड (ओटीपी) भेजने हेतु अपने मोबाइल नंबर का उपयोग करने के लिए एसबीआई लाइफ इंश्योरेंस कंपनी लि. को अपनी सहमति देता/देती हूँ और मैं एतद्द्वारा सम्मत और सहमत हूँ कि ओटीपी सत्यापन के माध्यम से प्रमाणन को प्रस्ताव फॉर्म पर मेरे हस्ताक्षर के रूप में माना जाएगा और यह कि एक बार ओटीपी आधारित प्रमाणन हो जाने पर इन दस्तावेजों पर मेरे कागजी हस्ताक्षरों की आवश्यकता नहीं होगी. एसबीआई लाइफ इंश्योरेंस कंपनी लि. ने मुझे सूचित किया है कि इस ओटीपी का उपयोग केवल <font color='blue'>${productName} - ${UINNo}</font> के लिए मेरे एसबीआई लाइफ आवेदन फॉर्म के प्रसंस्करण  के लिए किया जाएगा.`
        },
        {
            lang: 'Kannada',
            desc1 : `ಶ್ರೀ <font color='blue'>${custName}</font>, ಹೆಸರಿನ ನಾನು ಎಸ್‌ಬಿಐ ಲೈಫ್‌ ಇನ್‌ಶೂರೆನ್ಸ್‌ ಕಂಪೆನಿ ಲಿಮಿಟೆಡ್‌ಗೆ ಯುಐಡಿಎಐನ ಆಫ್‌ಲೈನ್‌ ಪರಿಶೀಲನಾ ಪ್ರಕ್ರಿಯೆಯನ್ನು ಬಳಸಿ, ನನ್ನ ಆಧಾರ್‌ಕಾರ್ಡ್‌/XML ಫೈಲ್‌ ಹಂಚಿಕೊಳ್ಳುವ ಮೂಲಕ ಆಧಾರ್‌ ಕಾರ್ಡ್‌/ಕ್ಯೂರ್‌ ಕೋಡ್‌ ಪ್ರತಿಯೊಂದಿಗೆ, ಹೆಸರು, ಜನ್ಮದಿನಾಂಕ, ವಿಳಾಸ, ಮೊಬೈಲ್‌ ನಂಬರ್‌, ಇಮೇಲ್‌, ಪೋಟೋಗ್ರಾಫ್‌ ಮುಂತಾದ ಅಗತ್ಯ ವಿವರಗಳನ್ನು ಪಡೆಯಲು ಐಚ್ಛಿಕವಾಗಿ ಒಪ್ಪಿಗೆ ಮತ್ತು ಅಧಿಕಾರ ನೀಡುತ್ತಿದ್ದೇನೆ. ಈ ಮಾಹಿತಿಯನ್ನು ಎಸ್‌ಬಿಐ ಲೈಫ್‌ನವರು ವಿಶೇಷವಾಗಿ ಕೆವೈಸಿ ಉದ್ದೇಶಕ್ಕಾಗಿ ಮಾತ್ರ ಮತ್ತು ಕೆವೈಸಿ ಅಗತ್ಯತೆಗಳನ್ನು ಪೂರೈಸ ಬೇಕಾದ ಸಂದರ್ಭದಲ್ಲಿ ನನ್ನ ಪಾಲಿಸಿ/ಪಾಲಿಸಿಗಳ ಸಂಬಂಧಿತ ಎಲ್ಲಾ ಸೇವಾನಿರತ ಅಂಶಗಳಿಗೆ ಮತ್ತು ನನ್ನ ಲೈಫ್‌ ಇನ್‌ಶ್ಯೂರೆನ್ಸ್‌ ಪ್ರಸ್ತಾವನೆಗಳಲ್ಲಿನ ರಿಸ್ಕ್‌ನ್ನು ಸ್ವೀಕರಿಸಿ ಪಾಲಿಸಿ ನೀಡುವುದರಿಂದ ಆರಂಭಿಸಿ, ಪಾಲಿಸಿಯಲ್ಲಿ ಮಾಡಬೇಕಾದ ಹಲವಾರು ಪಾವತಿವರೆಗೆ, ಕೆವೈಸಿ ಮಾಹಿತಿ ಕಡ್ಡಾಯವಾಗಿರುವ ಕೆಲವು ಆಕಸ್ಮಿಕ ಸಂದರ್ಭಗಳವರೆಗೆ, ಕಂಟ್ರ್ಯಾಕ್ಟ್‌ ಕೊನೆಗೊಳ್ಳುವ ತನಕ ಬಳಸುವರೆಂದು ನಾನು ಅರಿತಿದ್ದೇನೆ ಮತ್ತು ಅದಕ್ಕೆ ಒಪ್ಪಿಕೊಳ್ಳುತ್ತೇನೆ. ಪರ್ಯಾಯ ಕೆವೈಸಿ ಕಾಗದಪತ್ರಗಳಾದ ಪಾಸ್‌ಪೋರ್ಟ್‌, ಮತದಾರರ ಗುರುತು ಕಾರ್ಡ್‌, ಡ್ರೈವಿಂಗ್‌ ಲೈಸನ್ಸ್‌, NREGA ಜಾಬ್‌ ಕಾರ್ಡ್‌, ನ್ಯಾಶನಲ್‌ ಪಾಪ್ಯುಲೇಶನ್‌ ರಿಜಿಸ್ಟರ್‌ನ ಪತ್ರ ಮುಂತಾದವುಗಳನ್ನು ಕೆವೈಸಿ ಪ್ರಕ್ರಿಯೆಯನ್ನು ಪೂರ್ಣಗೊಳಿಸಲು ಆಧಾರ್‌ನ ಬದಲಿಗೆ ಬಳಸಬಹುದೆಂದು ನನಗೆ ಸರಿಯಾಗಿ ತಿಳಿಸಲ್ಪಟ್ಟಿದೆ. ಹೀಗೆ ಸಂಗ್ರಹಿಸಲ್ಪಟ್ಟ ವಿವರಗಳನ್ನು ಎಸ್‌ಬಿಐ ಲೈಫ್‌ ಬಳಿ ಇಟ್ಟುಕೊಳ್ಳಲಾಗುವುದು ಮತ್ತು ಅದನ್ನು ನನಗೆ ಪಾಲಿಸಿ ನೀಡಲು ಮತ್ತು ನಂತರದ ಸೇವೆಗೆ ಮಾತ್ರ ಹಂಚಿಕೊಳ್ಳಲಾಗುವುದೆಂದು ನಾನು ಅರಿತಿದ್ದೇನೆ ಮತ್ತು ಅದಕ್ಕೆ ಒಪ್ಪಿಕೊಳ್ಳುತ್ತೇನೆ. ನನ್ನಿಂದ ಏನಾದರೂ ತಪ್ಪು ಮಾಹಿತಿ ನೀಡಲ್ಪಟ್ಟಿದ್ದರೆ, ಅದಕ್ಕಾಗಿ ನಾನು ಎಸ್‌ಬಿಐ ಲೈಫ್ ಅಥವಾ ಅದರ ಯಾವುದೇ ಅಧಿಕೃತ ಅಧಿಕಾರಿಗಳನ್ನು ಹೊಣೆಗಾರರನ್ನಾಗಿ ಮಾಡುವುದಿಲ್ಲ. ನನ್ನ ಪಾಲಿಸಿ/ಪಾಲಿಸಿಗಳಿಗೆ ಸಂಬಂಧಿತ ವಿವಿಧ ಸೇವೆಗಳು ಮತ್ತು ಇತರ ವಿಷಯದಲ್ಲಿ ಎಸ್‌ಎಮ್‌ಎಸ್‌ ಸಂದೇಶಗಳನ್ನು ಕಳುಹಿಸಲು ನನ್ನ ಮೊಬೈಲ್‌ ನಂಬರನ್ನು ಬಳಸಲು ಸಹ ಎಸ್‌ಬಿಐ ಲೈಫ್‌ಗೆ ಅಧಿಕಾರ ನೀಡುತ್ತಿದ್ದೇನೆ.`,
            desc2 : `ಶ್ರೀ <font color='blue'>${custName}</font>, ಹೆಸರಿನ ನಾನು, ದೃಢೀಕರಣಗೊಳಿಸುವ ಉದ್ಧೇಶಕ್ಕಾಗಿ ವನ್‌ ಟೈಮ್‌ ಪಾಸ್‌ವರ್ಡ್‌ [ಒಟಿಪಿ] ಕಳುಹಿಸಲು ನನ್ನ ಮೊಬೈಲ್‌ ನಂಬರ್‌ ಬಳಸಲು ಎಸ್‌ಬಿಐ ಲೈಫ್‌ ಇನ್‌ಶೂರೆನ್ಸ್‌ ಕಂಪೆನಿಗೆ ಒಪ್ಪಿಗೆ ನೀಡುತ್ತಿದ್ದೇನೆ ಮತ್ತು ಒಟಿಪಿ ಪರಿಶೀಲನೆಯ ಮೂಲಕ ನಡೆಸಿದ ದೃಢೀಕರಣವು ಪ್ರಪೋಸಲ್‌ ಫಾರಂ ಮೇಲೆ ಹಾಕಿದ ನನ್ನ ಸಹಿಯೆಂದು ಪರಿಗಣಿಸುವುದಕ್ಕೆ ನಾನು ಒಪ್ಪುತ್ತೇನೆ ಮತ್ತು ಅದಕ್ಕೆ ಸಮ್ಮತಿ ನೀಡುತ್ತೇನೆ ಮತ್ತು ಒಮ್ಮೆ ಒಟಿಪಿ ಮೂಲಕ ದೃಢೀಕರಣಗೊಂಡ ನಂತರ ಈ ಕಾಗದಪತ್ರಗಳಲ್ಲಿ ನಾನು ಸ್ವತಃ ಸಹಿ ಮಾಡಬೇಕೆಂದಿಲ್ಲ. ಈ ಒಟಿಪಿಯನ್ನು ನನ್ನ <font color='blue'>${productName} - ${UINNo}</font> ಎಸ್‌ಬಿಐ ಲೈಫ್‌ ಅರ್ಜಿಯ ಪ್ರಕ್ರಿಯೆಗಾಗಿ ಮಾತ್ರ ಬಳಸಲಾಗುವುದೆಂದು ಎಸ್‌ಬಿಐ ಲೈಫ್‌ ಇನ್‌ಶೂರೆನ್ಸ್‌ ಕಂಪೆನಿ ಲಿಮಿಟೆಡ್‌ ನನಗೆ ತಿಳಿಸಿದ್ದಾರೆ.`
        },
        {
            lang: 'Malayalam',
            desc1 : `ഞാൻ, ശ്രീ. <font color='blue'>${custName}</font>, എസ്ബിഐ ലൈഫ് ഇൻഷുറൻസ് കമ്പനി ലിമിറ്റഡിന് (എസ്ബിഐ ലൈഫ്) എന്‍റെ ആധാർ കാർഡിന്‍റെ പകർപ്പ്/യുഐഡിഎഐയുടെ ഓഫ്ലൈൻ വെരിഫിക്കേഷൻ പ്രക്രിയ ഉപയോഗിച്ച് പങ്കുവച്ച എന്‍റെ ആധാർ കാർഡിൽ/എക്സ്എംഎൽ ഫയലിൽ ലഭ്യമായിട്ടുള്ള ക്യുആർ കോഡ് വഴി എന്‍റെ പേര്, ജനന തീയതി, വിലാസം, മൊബൈൽ നമ്പർ, ഇമെയിൽ, ഫോട്ടോഗ്രാഫ് മുതലായ അത്യാവശ്യ വിവരങ്ങൾ ശേഖരിക്കുന്നതിന് ഇതിനാൽ സ്വമനസ്സാലെ സമ്മതം നൽകുകയും അതിനായി കമ്പനിയെ അധികാരപ്പെടുത്തുകയും ചെയ്തുകൊള്ളുന്നു. ഈ വിവരങ്ങൾ കെവൈസി ആവശ്യങ്ങളും എന്‍റെ പോളിസി/കളുമായി ബന്ധപ്പെട്ട സേവനങ്ങൾക്കു വേണ്ടി മാത്രം, കെവൈസി ആവശ്യങ്ങൾ പൂർത്തീകരിക്കേണ്ടിടത്ത്, ലൈഫ് ഇൻഷുറൻസിനു വേണ്ടിയുള്ള എന്‍റെ അപേക്ഷയ്ക്കു കീഴിലുള്ള റിസ്ക്ക് സ്വീകരിക്കപ്പെട്ടതിനു ശേഷം പോളിസി ഇഷ്യു ചെയ്യുന്നതു മുതൽ, പോളിസിക്കു കീഴിൽ നടത്തേണ്ട വിവിധ പേയ്മെന്‍റുകൾ, കെവൈസി വിവരങ്ങൾ നിർബന്ധമായിട്ടുള്ള വിവിധ സംഭവങ്ങൾ എന്നിവയ്ക്കു വേണ്ടി മാത്രം എസ്ബിഐ ലൈഫ് ഉപയോഗിക്കുന്നതാണെന്ന് ഞാൻ മനസ്സിലാക്കുകയും സമ്മതിക്കുകയും ചെയ്യുന്നു. കെവൈസി നടപടികൾ പൂർത്തീകരിക്കുന്നതിനായി എനിക്ക് ആധാർ കാർഡിനു പകരം പാസ്പോർട്ട്, വോട്ടേഴ്സ് ഐഡി കാർഡ്, ഡ്രൈവിംഗ് ലൈസൻസ്, നറിഗ ജോബ് കാർഡ്, നാഷണൽ പോപ്പുലേഷൻ രജിസ്റ്ററിൽ നിന്നുള്ള കത്ത് മുതലായ മറ്റ് കെവൈസി രേഖകളായി ഉപയോഗിക്കാൻ സാധിക്കുമെന്ന് എന്നെ അറിയിച്ചിട്ടുണ്ട്. ഇപ്രകാരം ശേഖരിക്കുന്ന വിവരങ്ങൾ എനിക്ക് ഇൻഷുറൻസ് പോളിസി ഇഷ്യു ചെയ്യുന്നതിനും അവയുമായി ബന്ധപ്പെട്ട സേവനങ്ങൾ നൽകുന്നതിനും വേണ്ടി മാത്രം എസ്ബിഐ ലൈഫ് സൂക്ഷിക്കുകയും പങ്കു വയ്ക്കുകയും ചെയ്യുമെന്ന് ഞാൻ മനസ്സിലാക്കുകയും സമ്മതിക്കുകയും ചെയ്യുന്നു. ഞാൻ ഏതെങ്കിലും വിവരങ്ങൾ തെറ്റായി നൽകുകയാണെങ്കിൽ അതിന് എസ്ബിഐ ലൈഫിനെയോ അതിന്‍റെ ഏതെങ്കിലും അംഗീകൃത ഉദ്യോഗസ്ഥനെയോ ഞാൻ ഉത്തരവാദിയായി കണക്കാക്കുകയില്ല. എന്‍റെ പോളിസി/കളുമായി ബന്ധപ്പെട്ട വിവിധ സേവനങ്ങളും മറ്റു വിഷയങ്ങളും സംബന്ധിച്ച് എനിക്ക് അലർട്ട് മെസ്സേജുകൾ അയയ്ക്കുന്നതിനായി എന്‍റെ മൊബൈൽ നമ്പർ ഉപയോഗിക്കുന്നതിനും ഞാൻ എസ്ബിഐ ലൈഫിനെ അധികാരപ്പെടുത്തുന്നു.`,
            desc2 : `ഞാൻ, ശ്രീ. <font color='blue'>${custName}</font>, എസ്ബിഐ ലൈഫ് ഇൻഷുറൻസ് കമ്പനി ലിമിറ്റഡിന് ആധികാരികത ഉറപ്പാക്കുന്നതിനുള്ള ഉദ്ദേശ്യത്തിനു വേണ്ടി വൺ ടൈം പാസ്സ്‌വേർഡ് അയയ്ക്കുന്നതിനായി എന്‍റെ മൊബൈൽ നമ്പർ ഉപയോഗിക്കുന്നതിന് ഇതിനാൽ സമ്മതം നൽകുകയും ഒടിപി വഴിയുള്ള ആധികാരികതയെ പ്രൊപ്പോസൽ ഫോറത്തിലെ എന്‍റെ ഒപ്പായി കണക്കാക്കുന്നതിന് ഇതിനാൽ അംഗീകരിക്കുകയും സമ്മതിക്കുകയും ചെയ്യുന്നു. ഒടിപി വഴിയുള്ള ആധികാരികത നടത്തിയതിനു ശേഷം ഈ രേഖകളിൽ എന്‍റെ നേരിട്ടുള്ള ഒപ്പിന്‍റെ ആവശ്യമില്ല. ഇത് <font color='blue'>${productName} - ${UINNo}</font> നു വേണ്ടിയുള്ള എന്‍റെ എസ്ബിഐ ലൈഫ് അപക്ഷോ ഫോറം പ്രൊസസ്സ് ചെയ്യുന്നതിനു വേണ്ടി മാത്രമേ ഇത് ഉപയോഗിക്കുകയുള്ളു എന്ന് എസ്ബിഐ ലൈഫ് ഇൻഷുറൻസ് കമ്പനി ലിമിറ്റഡ് എന്നെ അറിയിച്ചിട്ടുണ്ട്.`
        },
        {
            lang: 'Manipur',
            desc1 : `ঐ, শ্রী <font color='blue'>${custName}</font>, এসবিআই লাইফ ইন্সুরেন্স কম্পেনী লিমিতেদ (এসবিআইলাইফ)তা ভোলুন্তরী ওইনা ঐগী অয়াবা পীজরি অমসুং কম্পেনীদা মরুওইবা ৱারোলশিংখুদম ওইনা মিং, পোকপগী তাং, লৈফম, মোবাইল নম্বর, ইমেল, ফোতোগ্রাফ, ঐগী আধারকার্দতা য়াওবা আধার কার্দকী কোপী/ক্যু.আর. কোদ/UIDAIগী ওফলাইন ভেরিফিকেসন শিজিন্নদুনা শেয়র তৌখিবা XMLফাইলগী থোংদা লৌশিন্নবা অয়াবা পীজরি। ঐনা খঙলে অমদি অয়াবা পীরে মদুদি ই-পাও অসি শুপ্নগী কেৱাইসিগী পান্দমগীদমক্তা অমসুং ঐগী পোলিসী/শিংগা মরী লৈনবা সর্বিস পুম্নমক্কীদমক মরু ওইনা শিজিন্নগনি, কেৱাইসিগী মথৌ তাবশিং চৎনবা মফমদা, লাইফ ইন্সুরেন্সকীদমক্তা ঐগী প্রপোজেলগী মনুং চন্না রিস্ক (খুদোং থিনীংঙাই ওইবা)তা অয়াবা পীরবা মতুংদা পোলিসী থাদোকপদগী হৌরগা, পোলিসীগী মনুংদা পাংথোক্কদবা তোঙান তোঙানবা পেমেন্তশিং, কেৱাইসিগী ই-পাও, মথৌ তাবা তোঙান তোঙানবা ওইরকপা য়াবা থৌদোকশিংগী কন্ত্রেক্ত লোইদ্রিফাওবা। ঐঙোন্দা খঙহনখি মদুদি ঐনা অতৈ কেৱাইসিগী দোক্যুমেন্তশিং খুদম ওইনা পাসপোর্ত, ভোতর আইদি, দ্রাইবিং লাইসেন্স, এনআরইজিএ জোবকার্দ, নেস্নেল পোপুলেসন রেজিসতারদগী লাকপা চে-বাও শিজিন্নদুনা ঐগী কে.ৱাই.সি.গী ফোর্মেলিতীশিং মপুং ফাহন্নবা আধার মহুত্তা শিজিন্নবা য়াই। ঐনা খঙলে অমদি অয়াবা পীরে মদুদি মসিদগী ফংলকপা ৱারোলশিং অদু এসবিআই লাইফকী মফমদা থমজিনগনি অমসুং ঐঙোন্দা ইন্সুরেন্স পোলিসী থাদোক্নবগী থৌরাং অমসুং মদুগী সর্বিসিং তৌনবগীদমক শুপ্নগী শেয়রতমক তৌগনি। ঐনা ফোংদোকখিবা অরানবা ৱাফম অমা হেক্তগী মতাংদা ঐনা এসবিআই লাইফ নত্ত্রগা মসিগী কনাগুম্বা ওথোরাইজ তৌরবা ওফিসিএল অমত্তদা মরাল শিরোই। ঐনা এসবিআইলাইফতা হক অসি পীজরি মদুদি মসিনা তোঙান তোঙানবা সর্বিসকা মরী লৈনবা অমসুংঐগী পোলিসীগা মরী লৈনবা অতৈ হিরমশিংগী মতাংদা এসএমএস এলর্ত থানবগীদমক ঐগী মোবাইল নম্বর শিজিন্নবা য়াগনি।`,
            desc2 : `ঐ, শ্রী <font color='blue'>${custName}</font>, ওথেন্তিকেসনগীদমক্তা ৱান তাইম পাসৱর্দ (ওতিপি) থাননবা ঐগী মোবাইল নম্বর শিজিন্ননবা এসবিআই লাইফ ইন্সুরেন্স লিমিতেদতা অয়াবা পীজরি অমসুং ঐনা য়ারে অমদি অয়াবা পীজরে মদুদি ওতিপি ভেরিফিকেনগী থোংদা ওথেন্তিকেসন অসি প্রপোজেল ফোর্মদা সিগনেচর ওইনা লৌগনি অমসুং ওতিপিদা য়ুম্ফম ওইবা ওথেন্তিকেসন অমুকপু তৌখ্রবদি দোকুমেন্তশিং অদুদা ঐগী ফিজিকেল সিগনেচরগী মথৌ তাদ্রে। এসবিআই লাইফ ইন্সুরেন্স লিমিতেদনা ঐঙোন্দা খঙহল্লে মদুদি ওতিপি অসি শুপ্নগী <font color='blue'>${productName} - ${UINNo}</font> গীদমক্তা ঐগী এসবিআই লাইফ এপ্লিকেসন ফোর্ম চৎথনবগীদমক শিজিন্নগনি।`
        },
        {
            lang: 'Marathi',
            desc1 : `मी, श्री. <font color='blue'>${custName}</font> याद्वारे एसबीआय लाइफ इन्शुरन्स कंपनी लिमिटेड (एसबीआय लाइफ) यांना माझी स्वेच्छिक संमती देत आहे आणि यूआयडीएआयची ऑफलाईन पडताळणी प्रक्रिया वापरून आधार कार्ड आणि माझ्या आधार कार्डावर असलेल्या क्यूआर कोड द्वारे/दिलेल्या एक्सएमएल फाईल मध्ये उपलब्ध नाव, जन्मतारीख, पत्ता, मोबाईल क्रमांक, ईमेल, छायाचित्र यासारखा आवश्यक तपशील मिळविण्याचे कंपनीला अधिकार देत आहे. मला माहित आहे आणि मी यास सहमत आहे की, फक्त एसबीआय लाइफ द्वारा केवायसी साठी आणि पॉलिसी/ज्‌च्या सर्व सेवासंबंधी पैलूंसाठी, जेथे जेथे केवायसीची पूर्तता करणे आवश्यक असेल, अशा जीवन विम्यासाठी माझ्या प्रस्तावाअंतर्गत जोखमीचा स्वीकार केल्यानंतर पॉलिसीज जारी केल्यापासून, पॉलिसी अंतर्गत विविध प्रकारे पैसे भरायचे असतील, कंत्राट रद्द होईपर्यंत, जेथे केवायसी माहिती बंधनकारक असेल अशी विविध आनुषंगिक कामे करण्यासाठी, ह्या माहितीचा उपयोग करण्यात येईल. मला याची योग्य माहिती देण्यात आली आहे की, केवायसीचे कामकाज पूर्ण करण्यासाठी आधार कार्डाऐवजी मी पासपोर्ट, मतदार ओळखपत्र, वाहन चालविण्याचा परवाना, नरेगा जॉब कार्ड, राष्ट्रीय लोकसंख्या रजिस्टर यांचे पत्र, यासारख्या पर्यायी केवायसी दस्तऐवजांचा उपयोग देखील करू शकेन. मला माहित आहे आणि मी यास सहमत आहे की, अशा प्रकारे मिळविण्यात आलेला तपशील एसबीआय लाइफ यांचेकडे साठवून ठेवण्यात येईल आणि केवळ मला विमा पॉलिसी जारी करणे आणि त्यासंबंधी सेवा देणे याच कारणांसाठी ती इतरांना दिली जाईल. मी काही चुकीची माहिती दिल्यास मी त्यासाठी एसबीआय लाइफ किंवा त्यांचे अधिकृत अधिकारी यांना जबाबदार धरणार नाही. मी एसबीआय लाइफ यांना अधिकार देत आहे की, ते माझ्या पॉलिसी/ज्‌ संबंधित विविध सेवा आणि इतर कामांसाठी एसएमएस पाठविण्यासाठी माझ्या मोबाईल क्रमांकाचा उपयोग करू शकतील.`,
            desc2 : `मी, श्री. <font color='blue'>${custName}</font> याद्वारे एसबीआय लाइफ इन्शुरन्स कंपनी लि. यांना प्रमाणिकरणासाठी वन टाईम पासवर्ड (ओटीपी) पाठविण्यासाठी माझ्या मोबाईल क्रमांकाचा उपयोग करण्यास माझी संमती देत आहे आणि मी याद्वारे सहमत आहे आणि संमती देत आहे की सदर ओटीपी पडताळणीद्वारे केलेले प्रमाणिकरण हे प्रस्ताव प्रपत्रावर माझी स्वाक्षरी समजण्यात येईल आणि एकदा ओटीपीवर आधारित प्रमाणिकरण केल्यानंतर ह्या दस्तऐवजांवर माझ्या प्रत्यक्ष स्वाक्षरीची गरज नाही. एसबीआय लाइफ इन्शुरन्स कंपनी लि. यांनी मला कळविले आहे की ह्या ओटीपीचा फक्त <font color='blue'>${productName} - ${UINNo}</font> साठी माझ्या एसबीआय लाइफ अर्जाच्या प्रक्रियेसाठी उपयोग करण्यात येईल.`
        },
        {
            lang: 'Marwadi',
            desc1 : `मैं, श्री <font color='blue'>${custName}</font> इण साथै एसबीआई लाइफ इन्श्योरेन्स  लिमिटेड (एसबीआई लाइफ) नै आपणी स्वैच्छिक सहमति देऊं हूं अर कंपनी नै प्राधिकृत करूं हूं कि बै म्हारा जरूरी विवरण जियां नाम, जन्म री तारीख, पतो, मोबाइल नंबर, ईमेल, फोटो यूआईडीएआई री ऑफलाइन सत्यापन प्रक्रिया रो प्रयोग करता हुया मेरा आधार कार्ड/एक्सएमएल फाइल माले उपलब्ध आधार कार्ड/क्यूआर कोड री प्रति रै माध्यम सूं ले सकै  हैं।. मैं समझूं हूं अर सहमत हूं कि जाणकारी रो प्रयोग मात्र एसबीआई लाइफ ही केवाईसी प्रयोजनां वासतै करसी ऐर जीवन बीमै खातर मेरा प्रोपोजलां रे अंतर्गत जोखिम नै स्वीकारणै रै बाद मेरी पॉलिसी/पॉलिसियां संबंधी सिगळा सेवा पहलुआं, पॉलिसियां रै अंतर्गत जित्ता भी भुगतान करयोड़ा हुवै बै, जठै भी केवाईसी जरूरी हुवै बठै, सूं लेर जठै भी केवाईसी री जरूरत होसी बीं नै  अनुबंध समाप्त होण तांईं पूरो करसी। मन्नै पूरी तरां बता दियो गयो है कि मैं वैकल्पिक केवाईसी कागद जियां पासपोर्ट, वोटर आईडी कार्ड, ड्राइविंग लाइसेन्स, नरेगा जॉब कार्ड, नेशनल पापुलेशन रजिस्टर रो पत्र, रो प्रयोग मैं आधार कार्ड री जगां मेरी केवाई औपचारिकतांवां पूरी करण खातर कर सकूं हूं. मैं समझूं हूं ऐर सहमत हूं कि इण तरां जो भी जाणकारी ली जासी बिण नै एसबीआई लाइफ कनै राख्यो जासी ऐर मन्नै बीमा पॉलिसी जारी करण खातर ऐर इण नै पुगावण खातर ही दियो जासी. मैं जिकी जाणकारी दी है बीं मैं कोई गलती होने पर मैं एसबीआई लाइफ या इण रा कोई अधिकृत अधिकारि‍यां नै जिम्मेदार नहीं ठहराऊंला. मैं एसबीआई लाइफ नै ओ प्राधिकार और देऊं हूं कि बै मेरै मोबाइल नंबर रो प्रयोग मन्नै विभिन्न सर्विसिंग ऐर अन्य पॉलिसी संबंधी मामलां रै बारै एसएमएस अलर्ट भेजण खातर कर सकै है.`,
            desc2 : `मैं, श्री <font color='blue'>${custName}</font> इण अनुसार आपणी सहमति एसबीआई लाइफ इन्श्योरेन्स कंपनी लि. नै देऊं हूं कै बै म्हारै मोबाइल नंबर रो उपयोग अधिप्रमाणन प्रयोजनां खातर वन टाइम पासवर्ड (ओटीपी) भेजण खातर कर सकै है ओटीपी रै माध्यम सूं सत्यापन नै प्रोपोजल फार्म पर मेरा हस्ताक्षर करयोड़ा मानीजैगा ऐर ओ कि मेरा भौतिक हस्ताक्षरां री जरूरत एकर ओटीपी आधार पर अधिप्रमाणन करयां पछै इण कागदां पर नहीं रहसी. एसबीआई लाइफ  इन्श्योरेन्स कंपनी लि. मन्नै सूचित करयो है कि इण ओटीपी रो उपयोग <font color='blue'>${productName} - ${UINNo}</font> खातर मेरै एसबीआई लाइफ एप्लीकेशन फार्म री प्रक्रिया करण खातर ही होसी.`
        },
        {
            lang: 'Mizo',
            desc1 : `Kei, Pu <font color='blue'>${custName}</font> hian SBI Life Insurance Company Ltd (SBI Life) hnênah hian ka duhthu ngeiin ka Hming, DOB, Address, Mobile Number, email, Aadhaar card/QR code a XML File shared hmanga offline a finfiahna UIDAI kaltlanga an neih ka phal. Hêng ka lehkha pawimawh te hi SBI Life hian KYC atân leh ka policy/ies atân chiah an hman ka remti a, khawiah pawh KYC  a ngaih hunah, policy lâk tan hunah leh ka life insurance atâna thil pawi awm thei ang ka pawm hnua ah leh eng emaw atâna pawisa ka policy hnuaia pêk a ngaih hunah te, thil thenkhata KYC a ngaih hunah te leh kan contract a tawp thlengin. Ka KYC atân hian hêng ka lehkha pawimawh dang Passport, Voter’s ID Card, Driving licence, NREGA job card, National Population Register lehkha te Aadhaar aiah ka hmang thei tih chiang taka hrilh hriat ka ni. Ka lehkha pawimawh te hi SBI Life in an kawl that ka  remti a, insurance policy min pêk chhuah nan leh enkawl zui nan an hmang ang tih ka hre thiam a, chumi atân chiah  chuan an hman ka phal bawk. Thil dik lo ka lo pe palh anih chuan SBI Life emaw an hnathawktu te ka mawhpuh lovang. Hei bakah hian SBI Life ten ka mobile number hi ka policy/ies kaihhnawih thil hrang hrang min hriattirna atâna  sms min thawn nân an hman ka phal bawk e.`,
            desc2 : `Kei, Pu <font color='blue'>${custName}</font> hian SBI Life Insurance Company Ltd hnênah hian ka Mobile Number hi One Time Password (OTP) keimah ka nih ngei leh ngei loh fiah nâna min thawnna atân an hman ka phal a, hei bakah hian keimah ka nih ngei leh ngei loh fiah nâna OTP an hman hi ka hming ziak anga an Proposal Form-ah an hman ka remti in ka pawm, hemi anih avang hian keimah ngei kal ngai lovin lehkhaa ka hming ka ziah ngaihna te chu OTP hmanga keimah ngei ka ni tih fiahna a zawh tawh chuan keimah ngei kala hming ziak ang ka ni tih ka pawm. SBI Life Insurance Company Ltd hian ka OTP chu SBI Life dilna form <font color='blue'>${productName} - ${UINNo}</font> atân chauh an hmang ang tih min hrilh bawk.`
        },
        {
            lang: 'Oriya',
            desc1 : `ମୁଁ ଶ୍ରୀ <font color='blue'>${custName}</font>, ଏହାସହିତ ମୋର ସ୍ୱେଚ୍ଛାକୃତ ସହମତି ଏସ୍‌ବିଆଇ ଲାଇଫ୍‌  ଇନସ୍ୟୁରାନ୍ସ କମ୍ପାନି ଲିମିଟେଡ୍‌ (ଏସ୍‌ବିଆଇ ଲାଇଫ୍) କୁ ମୋର ସହମତି ପ୍ରଦାନ କରୁଛି ଓ କମ୍ପାନିକୁ ପ୍ରାଧିକୃତ କରୁଛି ଯେ ଏହା  ଆବଶ୍ୟକ ସବିଶେଷ ଯେପରିକି ନାମ, ଜନ୍ମ ବର୍ଷ, ଠିକଣା, ମୋବାଇଲ୍‌ ନମ୍ବର, ଇମେଲ୍‌, ଫଟୋଗ୍ରାଫ୍‌ ଆଧାର କାର୍ଡର ନକଲ ମାଧ୍ୟମରେ / କିମ୍ବା ମୋର ଆଧାର କାର୍ଡରେ ଉପଲବ୍ଧ କୋଡ୍‌ /  UIDAI.ର ଅଫ୍‌ଲାଇନ୍‌ ସତ୍ୟାପନ ପ୍ରକ୍ରିୟା ବ୍ୟବହାର କରି ସେୟାର୍‌ ହେଉଥିବା XML ଫାଇଲ୍‌ରୁ ପ୍ରାପ୍ତ କରିପାରିବେ । ମୁଁ ବୁଝିପାରିଛି ଓ ସହମତ ଯେ ଏହି ସୂଚନାଗୁଡ଼ିକ ଏସ୍‌ବିଆଇ ଲାଇଫ୍‌ ଦ୍ୱାରା କେବଳ କେ.ୱାଇ.ସି ଉଦ୍ଦେଶ୍ୟରେ ଓ ମୋର ପଲିସି(ଗୁଡ଼ିକ) ସହିତ ସଂପୃକ୍ତତା ସମସ୍ତ ସେବା, ଯେତେବେଳେ ମଧ୍ୟ କେ.ୱାଇ.ସିର ଆବଶ୍ୟକତା ପୂରଣ କରିବାକୁ ପଡ଼ିବ, ପଲିସି ସମ୍ବନ୍ଧିତ ସମସ୍ୟାଠାରୁ ଆରମ୍ଭ କରି ଜୀବନ ବୀମା ପାଇଁ ମୋର ପ୍ରସ୍ତାବ, ବିଭିନ୍ନ ପ୍ରକାରର ଦେୟ ପ୍ରଦାନ ଯାହା ପଲିସି ଅଧିନରେ କରିବାକୁ ପ଼ଡ଼ିପାରେ, ବିଭିନ୍ନ ପ୍ରକାରର ଆକସ୍ମିକ ବ୍ୟୟ ଯେଉଁଠାରେ କେ.ୱାଇ.ସି ତଥ୍ୟ ପ୍ରଦାନ କରିବା ଚୁକ୍ତି ଶେଷ ହେବା ପର୍ଯ୍ୟନ୍ତ ବାଧ୍ୟତାମୂଳକ ହୋଇଥାଏ, ସେଠାରେ ବ୍ୟବହାର କରାଯିବ। ମୋତେ ଯଥାବିଧି ସତର୍କ କରାଯାଇଛି ଯେ ମୁଁ କେ.ୱାଇ.ସିର ବିକଳ୍ପ ଯେପରିକି ପାସ୍‌ପୋର୍ଟ, ଭୋଟର୍‌ ଆଇଡି କାର୍ଡ, ଡ୍ରାଇଭିଂ ଲାଇସେନ୍ସ, ଏନ୍‌.ଆର୍‌.ଇ.ଜି.ଏ ବୃତ୍ତି ପତ୍ର, ଜାତୀୟ ଜନସଂଖ୍ୟା ରେଜିଷ୍ଟର୍‌ ଆଦିକୁ ଆଧାର ସ୍ଥାନରେ ମୋର କେ.ୱାଇ,ସି ଫର୍ମାଲିଟିଜ୍ ପୂରଣ କରିବା ପାଇଁ ବ୍ୟବହାର କରିପାରିବି। ମୁଁ ବୁଝିଛି ଓ ସହମତ ଯେ ପ୍ରାପ୍ତ ହୋଇଥିବା ସବିଶେଷକୁ ଏସ୍‌ବିଆଇ ଲାଇଫ୍‌ରେ ଗଚ୍ଛିତ କରି ରଖାଯିବା ଉଚିତ ହେବ ଓ କେବଳ ମୋତେ ଓ ସେଗୁଡ଼ିକର ସର୍ଭିସ୍‌ ପାଇଁ ବୀମା ପଲିସ୍‌ ଇସ୍ୟୁ କରିବା ଉଦ୍ଦେଶ୍ୟରେ ସେୟାର୍‌ କରାଯିବା ଉଚିତ। ମୋ ଦ୍ୱାରା କୌଣସି ଭୁଲ୍‌ ସୂଚନା ଯୋଗାଯାଇଥିଲେ ଏଥିପାଇଁ ଏସ୍‌ବିଆଇ ବା ଅନ୍ୟ କୌଣସି ପ୍ରାଧିକୃତ କର୍ମଚାରୀଙ୍କୁ ଉତ୍ତରଦାୟୀ ବୋଲି ମନେ କରିବି ନାହିଁ । ମୁଁ ଆହୁରି ମଧ୍ୟ ଏସ୍‌ବିଆଇ ଲାଇଫ୍‌କୁ ପ୍ରାଧିକୃତ କରୁଛି ଯେ ବିଭିନ୍ନ ପ୍ରକାର ସର୍ଭିସିଂ ପାଇଁ ମୋତେ ଏସ୍‌ଏମ୍‌ଏସ୍‌ ଅଲର୍ଟ ଓ ମୋର ପଲିସି(ଗୁଡିକ) ସହିତ ସମ୍ପର୍କିତ ଅନ୍ୟ ବିଷୟ ସମ୍ବନ୍ଧରେ ଏସ୍‌ଏମ୍‌ଏସ୍‌ ଆଲର୍ଟ ପଠାଇବାକୁ ମୋର ନମ୍ବର ବ୍ୟବହାର କରିପାରିବେ ।`,
            desc2 : `ମୁଁ ଶ୍ରୀ <font color='blue'>${custName}</font>, ଏହାସହିତ ମୁଁ ଏସ୍‌ବିଆଇ ଲାଇଫ୍‌ ବୀମା କମ୍ପାନି ଲିମିଟେଡକୁ ଅଧିପ୍ରମାଣନ ଉଦ୍ଦେଶ୍ୟରେ ଏକକାଳୀନ ପାସ୍‌ୱାର୍ଡ (ଓଟିପି) ପଠାଇବା ପାଇଁ ମୋର ମୋବାଇଲ୍‌ ନମ୍ବର ବ୍ୟବହାର କରିବାକୁ ଅନୁମତି ଦେଉଛି ଆଉ ମୁଁ ଏହାସହିତ ମୋର ସହମତି ପ୍ରଦାନ କରୁଛି ଯେ ପ୍ରସ୍ତାବ ଫର୍ମରେ ଓଟିପି ମାଧ୍ୟମରେ ଅଧିପ୍ରମାଣନକୁ ମୋର ସ୍ୱାକ୍ଷର ଭାବେ ବିବେଚନା କରାଯାଉ ଓ ଓଟିପିର ଅଧିପ୍ରମାଣନ ଥରେ ହୋଇଯିବା ପରେ ଏହି ଡକ୍ୟୁମେଣ୍ଟଗୁଡ଼ିକରେ ମୁଁ ସଶରୀରେ ସ୍ୱାକ୍ଷର କରିବାର କୌଣସି ଆବଶ୍ୟକତା ନାହିଁ । ଏସ୍‌ବିଆଇ ଜୀବନ ବୀମା କମ୍ପାନି ଲିମିଟେଡ୍‌ ମୋତେ ଜଣାଇଛନ୍ତି ଯେ ଏହି ଓଟିପି କେବଳ ମୋର <font color='blue'>${productName} - ${UINNo}</font> ଲାଇଫ୍‌ ଆପ୍ଲିକେସନ୍‌ ଫର୍ମର ପ୍ରକ୍ରିୟାକରଣ ପାଇଁ ବ୍ୟବହାର କରାଯିବ ।`
        },
        {
            lang: 'Punjabi',
            desc1 : `ਮੈਂ, ਸ਼੍ਰੀ <font color='blue'>${custName}</font>, ਇਸ ਨਾਲ ਐਸਬੀਆਈ ਲਾਈਫ਼ ਇੰਸ਼ੋਰੈਂਸ ਕੰਪਨੀ ਲਿਮਿਟੇਡ (ਐਸਬੀਆਈ ਲਾਈਫ਼) ਨੂੰ ਸਵੈ-ਇੱਛਾ ਨਾਲ ਸਹਿਮਤੀ ਦਿੰਦਾ ਹਾਂ ਅਤੇ ਕੰਪਨੀ ਨੂੰ ਮੇਰੇ ਨਾਂ, ਜਨਮ ਦੀ ਮਿਤੀ, ਪਤਾ, ਮੋਬਾਈਲ  ਨੰਬਰ, ਈ-ਮੇਲ, ਫ਼ੋਟੋਗ੍ਰਾਫ ਵਰਗੇ ਜ਼ਰੂਰੀ ਵੇਰਵੇ ਆਧਾਰ ਕਾਰਡ ਦੀ ਕਾਪੀ/ਮੇਰੇ ਆਧਾਰ ਕਾਰਡ ਉੱਤੇ ਮੌਜੂਦ ਕਿਊਆਰ ਕੋਡ/ਯੂਆਈਡੀਏਆਈ ਦੀ ਔਫ਼ਲਾਈਨ ਤਸਦੀਕ ਦੀ ਪ੍ਰਕ੍ਰਿਆ ਦੀ ਵਰਤੋਂ ਕਰਕੇ ਸਾਂਝੀ ਕੀਤੀ ਗਈ ਐਕਸਅਐਮਐਲ ਫ਼ਾਇਲ ਰਾਹੀਂ ਹਾਸਲ ਕਰਨ ਲਈ ਅਧਿਕ੍ਰਿਤ ਕਰਦਾ ਹਾਂ । ਮੈਂ ਸਮਝਦਾ ਹਾਂ ਅਤੇ ਸਹਿਮਤ ਹਾਂ ਕਿ ਇਹ ਜਾਣਕਾਰੀ ਸਿਰਫ਼ ਐਸਬੀਆਈ ਲਾਈਫ਼ ਦੁਆਰਾ ਕੇਵਲ ਕੇਵਾਈਸੀ ਦੇ ਮਕਸਦ ਲਈ ਅਤੇ ਮੇਰੀ ਪਾਲਸੀ/ਆਂ ਨਾਲ ਸਬੰਧਿਤ ਸਾਰੇ ਸੇਵਾ ਪੱਖਾਂ ਲਈ, ਜਿੱਥੇ ਕਿਤੇ ਕੇਵਾਈਸੀ ਜ਼ਰੂਰਤਾਂ ਤੇ ਅਮਲ ਕਰਨਾ ਹੋਵੇਗਾ, ਉੱਥੇ ਜੀਵਨ ਬੀਮੇ ਲਈ ਮੇਰੇ ਪ੍ਰਸਤਾਵਾਂ ਦੇ ਅਧੀਨ ਜੋਖਮ ਸਵੀਕਾਰ ਕਰਨ ਤੋਂ ਬਾਅਦ ਪਾਲਸੀ ਜਾਰੀ ਕਰਨ ਤੋਂ ਲੈ ਕੇ, ਵਿਭਿੰਨ ਅਦਾਇਗੀਆਂ ਜੋ ਪਾਲਸੀਆਂ ਦੇ ਅਧੀਨ ਕੀਤੀਆਂ ਜਾਣੀਆਂ ਹਨ, ਵਿਭਿੰਨ ਅਨਿਸ਼ਚਿਤਤਾਵਾਂ ਜਿੱਥੇ ਕੇਵਾਈਸੀ ਜਾਣਕਾਰੀ ਲਾਜ਼ਮੀ ਹੈ, ਇਕਰਾਰਨਾਮਾ ਸਮਾਪਤ ਹੋਣ ਤਕ, ਵਰਤੀ ਜਾਵੇਗੀ । ਮੈਨੂੰ ਬਾਕਾਇਦਾ ਦੱਸਿਆ ਗਿਆ ਹੈ ਕਿ ਮੈਂ ਆਪਣੀ ਕੇਵਾਈਸੀ ਦੀਆਂ ਰਸਮੀ ਕਾਰਵਾਈਆਂ ਪੂਰੀਆਂ ਕਰਨ ਦੇ ਮਕਸਦ ਲਈ ਆਧਾਰ ਦੇ ਬਦਲੇ ਵਿਕਲਪਕ ਦਸਤਾਵੇਜ਼ਾਂ, ਜਿਵੇਂ ਪਾਸਪੋਰਟ, ਮਤਦਾਤਾ ਪਛਾਣ-ਪੱਤਰ, ਡਰਾਈਵਿੰਗ ਲਾਇਸੰਸ, ਨਰੇਗਾ ਜੌਬ ਕਾਰਡ, ਨੈਸ਼ਨਲ ਪਾਪੂਲੇਸ਼ਨ ਰਜਿਸਟਰ ਦੇ ਪੱਤਰ ਦੀ ਵਰਤੋਂ ਕਰ ਸਕਦਾ/ਸਕਦੀ ਹਾਂ । ਮੈਂ ਜਾਣਦਾ ਹਾਂ ਅਤੇ ਸਹਿਮਤ ਹਾਂ ਕਿ ਇਸ ਤਰ੍ਹਾਂ ਪ੍ਰਾਪਤ ਵੇਰਵੇ ਐਸਬੀਆਈ ਲਾਈਫ਼ ਕੋਲ ਜਮ੍ਹਾ ਕੀਤੇ ਜਾਣਗੇ ਅਤੇ ਕੇਵਲ ਮੈਨੂੰ ਬੀਮਾ ਪਾਲਸੀ ਜਾਰੀ ਕਰਨ ਅਤੇ ਉਹਨਾਂ ਦੀ ਸਰਵਿਸਿੰਗ ਕਰਨ ਦੇ ਮਕਸਦ ਲਈ ਸਾਂਝੇ ਕੀਤੇ ਜਾਣਗੇ । ਮੇਰੇ ਦੁਆਰਾ ਦਿੱਤੀ ਗਈ ਕਿਸੇ ਵੀ ਗਲਤ ਜਾਣਕਾਰੀ ਦੇ ਮਾਮਲੇ ਵਿੱਚ ਮੈਂ ਐਸਬੀਆਈ ਲਾਈਫ਼ ਜਾਂ ਉਸ ਦੇ ਕਿਸੇ ਵੀ ਅਧਿਕ੍ਰਿਰਤ ਅਧਿਕਾਰੀ ਨੂੰ ਜ਼ਿੰਮੇਵਾਰ ਨਹੀਂ ਠਹਿਰਾਵਾਂਗਾ । ਮੈਂ ਐਸਬੀਆਈ ਲਾਈਫ਼ ਨੂੰ ਇਹ ਵੀ ਅਧਿਕ੍ਰਿਰਤ ਕਰਦਾ ਹਾਂ ਕਿ ਉਹ ਵਿਭਿੰਨ ਸੇਵਾਵਾਂ ਅਤੇ ਮੇਰੀ ਪਾਲਸੀ/ਆਂ ਨਾਲ ਜੁੜੇ ਦੂਜੇ ਮਾਮਲਿਆਂ ਬਾਰੇ ਐਸਐਮਐਸ ਅਲਰਟਸ ਭੇਜਣ ਲਈ ਮੇਰੇ ਮੋਬਾਇਲ ਨੰਬਰ ਦੀ ਵਰਤੋਂ ਕਰ ਸਕਦਾ ਹੈ ।`,
            desc2 : `ਮੈਂ, ਸ਼੍ਰੀ <font color='blue'>${custName}</font>, ਇਸ ਨਾਲ ਪ੍ਰਮਾਣਕਤਾ ਦੇ ਮਕਸਦ ਲਈ ਵਨ ਟਾਈਮ ਪਾਸਵਰਡ (ਓਟੀਪੀ) ਭੇਜਣ ਲਈ ਆਪਣੇ ਮੋਬਾਇਲ ਨੰਬਰ ਦੀ ਵਰਤੋਂ ਕਰਨ ਲਈ ਐਸਬੀਆਈ ਲਾਈਫ਼ ਇੰਸ਼ੋਰੈਂਸ ਕੰਪਨੀ ਲਿ. ਨੂੰ ਆਪਣੀ ਸਹਿਮਤੀ ਦਿੰਦਾ ਹਾਂ ਅਤੇ ਮੈਂ ਇਸ ਨਾਲ ਮੈਂ ਮੰਨਦਾ ਹਾਂ ਅਤੇ ਸਹਿਮਤ ਹਾਂ ਕਿ ਓਟੀਪੀ ਤਸਦੀਕ ਰਾਹੀਂ ਪ੍ਰਮਾਣਕਤਾ ਨੂੰ  ਪ੍ਰਸਤਾਵ ਫ਼ਾਰਮ ਤੇ ਮੇਰੇ ਦਸਤਖ਼ਤ ਮੰਨਿਆ ਜਾਵੇਗਾ ਅਤੇ ਇਹ ਕਿ ਇਕ ਵਾਰੀ ਓਟੀਪੀ ਆਧਾਰਿਤ ਪ੍ਰਮਾਣਕਤਾ ਹੋ ਜਾਣ ਤੇ ਇਹਨਾਂ ਦਸਤਾਵੇਜ਼ਾਂ ਤੇ ਮੇਰੇ ਅਸਲੀ ਦਸਤਖ਼ਤਾਂ ਦੀ ਲੋੜ ਨਹੀਂ ਹੈ । ਐਸਬੀਆਈ ਲਾਈਫ਼ ਇੰਸ਼ੋਰੈਂਸ ਕੰਪਨੀ ਲਿ. ਨੇ ਮੈਨੂੰ ਜਾਣਕਾਰੀ ਦਿੱਤੀ ਹੈ ਕਿ ਇਸ ਓਟੀਪੀ ਦੀ ਵਰਤੋਂ ਕੇਵਲ <font color='blue'>${productName} - ${UINNo}</font> ਲਈ ਮੇਰੇ ਐਸਬੀਆਈ ਲਾਈਫ਼ ਅਰਜ਼ੀ ਫ਼ਾਰਮ ਤੇ ਕਾਰਵਾਈ ਕਰਨ ਲਈ ਕੀਤੀ ਜਾਵੇਗੀ ।`
        },
        {
            lang: 'Tamil',
            desc1 : `நான், திரு. <font color='blue'>${custName}</font>, இதன்மூலம் எஸ்பிஐ லைஃப் இன்ஷ்யூரன்ஸ் கம்பெனி லிமிடெட் (எஸ்பிஐ லைஃப்)க்கு என்னுடைய தன்னார்வ ஒப்புதலை அளிக்கிறேன் மற்றும் UIDAI-ன் ஆஃப்லைன் சரிபார்ப்பு செயல்முறையைப் பயன்படுத்தி பகிர்ந்துகொள்ளப்பட்ட என்னுடைய ஆதார் அட்டை/ XML ஃபைல் மீது கிடைக்கும் ஆதார் அட்டையின் நகல்/ QR குறியீடு மூலம் பெயர், பிறந்த தேதி, முகவரி, மொபைல் எண், மின்அஞ்சல், புகைப்படம் போன்ற அவசியமான விவரங்களைப் பெற்றுக்கொள்ள நிறுவனத்திற்கு அங்கீகாரம் அளிக்கிறேன். நான் புரிந்துகொண்டேன் மற்றும் ஒத்துக் கொள்வது என்னவெனில் இந்தத் தகவல் பிரத்தியேகமாக எஸ்பிஐ லைஃப்-னால் எங்கெல்லாம் கேஒய்சி தேவைகள் நிறைவேற்றப்பட வேண்டுமோ, ஆயுள் காப்பீட்டிற்காக என்னுடைய முன்மொழிவுகளின் கீழ் ஆபத்தை ஏற்றுக்கொண்ட பிறகு பாலிசிகள் வழங்கப்பட்டதிலிருந்து, பாலிசிகளின் கீழ் செய்யப்பட உள்ள பலவித பணச் செலுத்தங்களுக்கும், பலவித தற்செயல்கள் என எங்கு கேஒய்சி தகவல் கட்டாயமானதோ அது முதல் ஒப்பந்தம் முடிவுறும் வரை   கேஒய்சி நோக்கத்திற்காக மற்றும் என்னுடைய பாலிசி(கள்) தொடர்புடைய அனைத்து சேவைகளுக்காக மட்டுமே பயன்படுத்திக் கொள்ளப்படும் என்பதாகும். எனக்கு முறையாக அறிவிக்கப்பட்டது என்னவெனில் நான் கடவுச்சீட்டு, வாக்காளர் அடையாள அட்டை, ஓட்டுநர் உரிமம், NREGA பணி அட்டை, தேசிய மக்கள்தொகை பதிவேட்டில் இருந்து கடிதம், போன்ற மாற்று கேஒய்சி ஆவணங்களையும் ஆதார் அட்டைக்கு பதிலாக என்னுடைய கேஒய்சி சம்பிரதாயங்களை நிறைவேற்றுவதற்காகப் பயன்படுத்தலாம் என்பதாகும். நான் புரிந்துகொண்டேன் மற்றும் ஒத்துக் கொள்வது என்னவெனில் இவ்விதமாக பெறப்பட்ட தகவல்கள் எஸ்பிஐ லைஃப் இடம் சேமித்து வைக்கப்படும் மற்றும் முற்றிலும் எனக்கு காப்பீட்டு பாலிசி வழங்குவதற்காக மற்றும் அவற்றின் சேவைக்கான நோக்கத்திற்காக பகிர்ந்து கொள்ளப்படும் என்பதாகும். என்னால் ஏதேனும் தவறான தகவல் வழங்கப்பட்டிருப்பின் எஸ்பிஐ  லைஃப் அல்லது அதன் அங்கீகாரம் பெற்ற அதிகாரிகளை பொறுப்பாக இருக்கச் செய்ய மாட்டேன். நான் மேலும் எஸ்பிஐ லைஃப்-க்கு அதிகாரம் அளிப்பது என்னவெனில் என்னுடைய பாலிசி(கள்) தொடர்புடைய பலவித சேவைகள் மற்றும் இதர விஷயங்கள் குறித்து எஸ்எம்எஸ் எச்சரிக்கைகள் அனுப்புவதற்காக என்னுடைய மொபைல் எண்ணை பயன்படுத்திக் கொள்ளலாம் என்பதாகும்.`,
            desc2 : `நான், திரு. <font color='blue'>${custName}</font>, இதன் மூலம் எஸ்பிஐ லைஃப் இன்ஷ்யூரன்ஸ் கம்பெனி லிமிடெட்-க்கு அதிகாரபூர்வ நோக்கங்களுக்காக ஒரு நேர கடவுச்சொல் (OTP) அனுப்புவதற்கு என்னுடைய மொபைல் எண்ணை பயன்படுத்திக்கொள்வதற்கு என்னுடைய ஒப்புதலை அளிக்கிறேன் மற்றும் நான் இதன் மூலம்  அங்கீகரிப்புக்காக OTP சரிபார்த்தல் மூலம் முன்மொழிவு படிவத்தின் மீது என்னுடைய கையொப்பமாக கருதப்படுவதற்கு மற்றும் இந்த ஆவணங்கள் மீது ஒரு முறை OTP அடிப்படையிலான அங்கீகரிப்பு செய்யப்பட்டுவிட்டால் நானே நேரடியாக கையொப்பங்களுக்கு தேவை இல்லை என்பதை ஒத்துக் கொள்கிறேன் மற்றும் ஒப்புதல் அளிக்கிறேன். எஸ்பிஐ லைஃப் இன்ஷ்யூரன்ஸ் கம்பெனி லிமிடெட் எனக்கு தெரிவித்திருப்பது என்னவெனில் இந்த OTP <font color='blue'>${productName} - ${UINNo}</font> க்காக என்னுடைய எஸ்பிஐ லைஃப் விண்ணப்ப படிவத்தை செயல்முறைப்படுத்துவதற்காக மட்டுமே பயன்படுத்திக் கொள்ளப்படும் என்பதாகும்.`
        },
        {
            lang: 'Telugu',
            desc1 : `నేను, శ్రీ. <font color='blue'>${custName}</font>  ఎస్‌బిఐ లైఫ్ ఇన్సూరెన్స్ కంపెనీ లిమిటెడ్ (ఎస్‌బిఐ లైఫ్)కి స్వేచ్ఛగా సమ్మతిని తెలియజేస్తూ మరియు కంపెనీకి యుఐడిఏఐ యొక్క ఆఫ్‌లైన్ ధృవీకరణ ప్రక్రియ ద్వారా పాలుపంచుకున్న నా ఆధార్ కార్డ్/XML ఫైల్‌లో అందుబాటులోగల ఆధార్ కార్డ్ ప్రతి/క్యుఆర్ కోడ్ ద్వారా పేరు, పుట్టిన తేది, చిరునామా, మొబైల్ నంబర్, ఈమేల్, ఫోటోగ్రాఫ్‌లాంటి వివరాలను పొందేందుకు అధికారం కలిగిస్తున్నాను. కెవైసి ఉద్ధేశాలు మరియు కెవైసి అవసరాలకు అనుగుణంగా ఉండవలసిన నా పాలసీ/లకు సంబంధించిన అన్ని సర్వీసు విషయాలకు మాత్రమే, నేను ప్రతిపాదించిన జీవిత బీమా కింద రిస్కు స్వీకరించి, పాలసీల కింద కొనసాగించవలసిన పలు చెల్లింపులు, కెవైసి తప్పనిసరైన పలు కంటిన్జిస్ నుంచి, ఒప్పందం ముగింపు వరకు, సమాచారాన్ని ఎస్‌బిఐ లైఫ్ విస్తృతంగా వాడుకోవచ్చునని నాకు అర్థమయ్యింది మరియు దానికి అంగీకరిస్తున్నాను. నా కెవైసి వ్యవహారాలను పూర్తి చేసుకునేందుకు ఆధార్‌కి బదులుగా పాస్‌పోర్ట్, ఎన్నికల గుర్తింపు కార్డ్, డ్రైవింగ్ లైసెన్స్, NREGA పని కార్డ్, జాతీయ జనాభా రిజిస్టర్‌వారి పత్రం లాంటి ప్రత్యామ్నాయ కెవైసి దస్తావేజులను కూడా వాడుకోవచ్చునని నాకు తెలియజేయడం జరిగింది. పొందిన వివరాలను ఎస్‌బిఐ లైఫ్ నిక్షిప్తం చేసుకొని మరియు నాకు పాలసీని జారీ చేసి మరియు దాని సర్వీసింగ్ కోసం మాత్రమే వాడుతుందని నాకు అర్థమయ్యింది మరియు అంగీకరిస్తున్నాను. నేను ఏదైనా తప్పుడు సమాధానం అందిస్తే ఎస్‌బిఐ లైఫ్‌నిగాని లేదా వారి అధీకృత అధికారులను కాని బాధ్యులను చేయను. నా పాలసీ/లకు సంబంధించిన పలు సర్వీసింగ్ మరియు ఇతర అంశాల కోసం  ఎస్‌ఎమ్‌ఎస్ హెచ్చరికలను పంపేందుకు నా మొబైల్ నంబర్ వాడేందుకు ఎస్‌బిఐ లైఫ్‌కి నేను అధికారం కలిగిస్తున్నాను.`,
            desc2 : `నేను శ్రీ. <font color='blue'>${custName}</font> ధృవీకరణ కోసం వన్ టైం పాస్‌వర్డ్ [ఓటిపి] పంపేందుకు నా మొబైల్ నంబర్‌ని వాడుకునేందుకు ఎస్‌బిఐ లైఫ్ ఇన్సూరెన్స్ కంపెనీ లి.కి సమ్మతి తెలియజేస్తున్నాను మరియు ఓటిపి ధృవీకరణ ద్వారా ప్రమాణీకరణను ప్రతిపాదన ఫారం పైన నా సంతకంగా పరిగణించేందుకు నేను సమ్మతి తెలియజేస్తున్నాను మరియు ఓటిపి ఆధారితమైన ప్రమాణీకరణ జరిగిన తర్వాత ఈ దస్తావేజుల పైన ఎలాంటి సంతకం అవసరం ఉండదు. ఈ ఓటిపిని నా ఎస్‌బిఐ లైఫ్ దరఖాస్తు పత్రం <font color='blue'>${productName} - ${UINNo}</font> ని ప్రాసెస్ చేసేందుకు మాత్రమే వినియోగిస్తారని ఎస్‌బిఐ లైఫ్ ఇన్సూరెన్స్ కంపెనీ లి. ద్వారా నాకు తెలియజేయడం జరిగింది.`
        }
    
    ]
    
    let langConsent;
    arrLanguage.forEach(element => {
        if(element.lang === localLang){
            langConsent = element;
        }
    });

    return langConsent;

    /* for (i = 0; i < arrLanguage.length; i++) {
        if(arrLanguage[i].lang === localLang)
            return arrLanguage[i]
    } */
}

function saveBase64PDF(pdfDocument) {
    return new Promise((resolve, reject) => {
        try {
            pdfMake.createPdf(pdfDocument).getBase64(base64PDF => {
                localStorage.setItem('pdfData', base64PDF);
                resolve(base64PDF);
            });
        } catch (error) {
            console.log(error)
        }
    });
}